Table of Contents
 Class IdeaConImportSettings
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
Represents settings of improt options into Idea Connections
public class IdeaConImportSettings
Inheritance
object
IdeaConImportSettings
Derived
IdeaSMemberImportSettings
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 IdeaConImportSettings()
Constructor - it sets default values
public IdeaConImportSettings()
Properties
 AmericanSubcode
Gets or sets the American Sub code None LRFD ASD, LRFD10, ASD10
public string AmericanSubcode { get; set; }
Property Value
string
 BimAppCode
The code which defines the source BIM application (the origin of the model)
public string BimAppCode { get; set; }
Property Value
string
 CanChangeDesignCodeInWizard
Can change design code in Wizard
public bool CanChangeDesignCodeInWizard { get; set; }
Property Value
bool
 ConnectionFileName
Gets or sets the name of the Connection project
public string ConnectionFileName { get; set; }
Property Value
string
 DefaultBoltAssembly
Gets or sets the name of the default bolt assembly
public string DefaultBoltAssembly { get; set; }
Property Value
string
 DefaultSteelMaterial
Gets or sets the name of the default material of plates which are added from the template
public string DefaultSteelMaterial { get; set; }
Property Value
string
 DefaultWeldMaterial
Gets or sets the name of the default weld material
public string DefaultWeldMaterial { get; set; }
Property Value
string
 DesignCode
Gets or sets the Design Code There can be : ECEN AISC CISC RUS
public string DesignCode { get; set; }
Property Value
string
 ExportAllLinearCombination
All linear combination will be exported to IDEA connection
public bool ExportAllLinearCombination { get; set; }
Property Value
bool
 OnePageWizard
One page wizard
public bool OnePageWizard { get; set; }
Property Value
bool
 OrderMembersById
If true, connected members in connection are ordered acoording to topological rules othewise by their IDs.
public bool OrderMembersById { get; set; }
Property Value
bool
 ProjectDescription
Description of the idea con project
public string ProjectDescription { get; set; }
Property Value
string
 ProjectName
Name of the project
public string ProjectName { get; set; }
Property Value
string
 RunningApplication
Running application
public string RunningApplication { get; set; }
Property Value
string
 StartIdeaStaticaApp
StartIdeaStaticaApp
public bool StartIdeaStaticaApp { get; set; }
Property Value
bool
 UseWizard
Open import wizard window
public bool UseWizard { get; set; }
Property Value
bool
 UserWizardBrand
Set user Wizard Brand
public string UserWizardBrand { get; set; }
Property Value
string
 WaitForExit
WaitForExit
public bool WaitForExit { get; set; }
Property Value
bool
 Edit this page